In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

In [5]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     16044 non-null  int64
 1   rental_date   16044 non-null  datetime64[ns]
 2   inventory_id  16044 non-null  int64
 3   customer_id   16044 non-null  int64
 4   return_date   15861 non-null  datetime64[ns]
 5   staff_id      16044 non-null  int64
 6   last_update   16044 non-null  datetime64[ns]
dtypes: datetime64[ns](3), int64(4)
memory usage: 877.5 KB

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [25]:
def rentals_month(engine, m, y):
    query = 'SELECT * FROM sakila.rental WHERE MONTH(rental_date) =' + str(m) + ' AND YEAR(rental_date) =(' + str(y) + ')'
    print(query)
    data = pd.read_sql_query(query, engine)
    return data

rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 8, 2005)

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =8 AND YEAR(rental_date) =(2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
5681,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
5682,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
5683,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
5684,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
5685,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [26]:
def rental_count_month(data, m, y):
    column_title = "rentals_" + str(m) + "_" + str(y)
    grouped = data.groupby('customer_id')
    rental_counts = grouped['rental_id'].count()
    data_df = rental_counts.to_frame(name=column_title)
    return data_df

mon_gr=rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 5, 2005)
month=rental_count_month(mon_gr,6,2005)
month

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =5 AND YEAR(rental_date) =(2005)

             rentals_6_2005
customer_id
1                         2
2                         1
3                         2
5                         3
6                         3
...                     ...
594                       4
595                       1
596                       6
597                       2
599                       1

[520 rows x 1 columns]

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [30]:
def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()
    data_df = pd.DataFrame({
    'Series 1': df1_rental_counts,
    'Series 2': df2_rental_counts,
    'Difference': df1_rental_counts - df2_rental_counts})
    print(data_df)


may= rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 5, 2005)
june = rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 6, 2005)

compare_rentals(may, june)

may.head()

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =5 AND YEAR(rental_date) =(2005)
SELECT * FROM sakila.rental WHERE MONTH(rental_date) =6 AND YEAR(rental_date) =(2005)
             Series 1  Series 2  Difference
customer_id
1                 2.0       7.0        -5.0
2                 1.0       1.0         0.0
3                 2.0       4.0        -2.0
4                 NaN       6.0         NaN
5                 3.0       5.0        -2.0
...               ...       ...         ...
595               1.0       2.0        -1.0
596               6.0       2.0         4.0
597               2.0       3.0        -1.0
598               NaN       1.0         NaN
599               1.0       4.0        -3.0

[598 rows x 3 columns]

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [34]:
def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()
    data_df = pd.DataFrame({
    'Rental per month 1': df1_rental_counts,
    'Rental per month 2': df2_rental_counts,
    'Difference': df1_rental_counts - df2_rental_counts})
compare_rentals

In [35]:
def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()

    data_df = pd.DataFrame({
        'Rental per month 1': df1_rental_counts,
        'Rental per month 2': df2_rental_counts,
    })

    # Calculate the 'Difference' column
    data_df['Difference'] = data_df['Rental per month 1'] - data_df['Rental per month 2']

    # Fill NaN values in the 'Difference' column with 0
    data_df['Difference'] = data_df['Difference'].fillna(0)
    
    # Fill any remaining NaN values in other columns with 0
    data_df = data_df.fillna(0)

    print(data_df)

# Assuming the rest of your code remains the same
# Call the compare_rentals function with your 'may' and 'june' DataFrames
# (assuming the 'rentals_month' function works as expected)
compare_rentals(may, june)

             Rental per month 1  Rental per month 2  Difference
customer_id
1                           2.0                 7.0        -5.0
2                           1.0                 1.0         0.0
3                           2.0                 4.0        -2.0
4                           0.0                 6.0         0.0
5                           3.0                 5.0        -2.0
...                         ...                 ...         ...
595                         1.0                 2.0        -1.0
596                         6.0                 2.0         4.0
597                         2.0                 3.0        -1.0
598                         0.0                 1.0         0.0
599                         1.0                 4.0        -3.0

[598 rows x 3 columns]

In [36]:
def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()

    data_df = pd.DataFrame({
        'Rental per month 1': df1_rental_counts,
        'Rental per month 2': df2_rental_counts,
    })

    # Fill NaN values in the first two columns with 0
    data_df[['Rental per month 1', 'Rental per month 2']] = data_df[['Rental per month 1', 'Rental per month 2']].fillna(0)

    # Calculate the 'Difference' column
    data_df['Difference'] = data_df['Rental per month 1'] - data_df['Rental per month 2']

    print(data_df)

# Assuming the rest of your code remains the same
# Call the compare_rentals function with your 'may' and 'june' DataFrames
# (assuming the 'rentals_month' function works as expected)
compare_rentals(may, june)

             Rental per month 1  Rental per month 2  Difference
customer_id
1                           2.0                 7.0        -5.0
2                           1.0                 1.0         0.0
3                           2.0                 4.0        -2.0
4                           0.0                 6.0        -6.0
5                           3.0                 5.0        -2.0
...                         ...                 ...         ...
595                         1.0                 2.0        -1.0
596                         6.0                 2.0         4.0
597                         2.0                 3.0        -1.0
598                         0.0                 1.0        -1.0
599                         1.0                 4.0        -3.0

[598 rows x 3 columns]